; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v4 ?v2)
             (pred_11 ?v1 ?v5)
             (pred_2 ?v4 ?v5)
             (pred_7 ?v6 ?v4 )
	     (pred_6 ?v4)
             (pred_12 ?v9)
             (pred_8 ?v1)
             (pred_3 ?v5)
             (pred_10 ?v4)
             (pred_9 ?v1)
             (pred_4 ?v4)
             (pred_1 ))



(:action op_2
:parameters (?v11 ?v8 ?v3 ?v10)
:precondition (and (pred_12 ?v11) (pred_12 ?v8) (pred_8 ?v3) (pred_3 ?v10)
          (pred_5 ?v11 ?v8) (pred_11 ?v3 ?v10)
                   (pred_2 ?v8 ?v10) (pred_6 ?v11) 
                   (pred_10 ?v8) (pred_9 ?v3))
:effect (and  (pred_4 ?v8) (not (pred_10 ?v8))))


(:action op_1
:parameters (?v11 ?v7)
:precondition (and (pred_12 ?v11) (pred_12 ?v7)
               (pred_6 ?v11) (pred_5 ?v11 ?v7) (pred_4 ?v7))
:effect (and (pred_6 ?v7) (not (pred_6 ?v11))))

(:action op_4
:parameters (?v11 ?v3)
:precondition (and (pred_12 ?v11) (pred_8 ?v3) 
                  (pred_6 ?v11) (pred_7 ?v3 ?v11) (pred_1 ))
:effect (and (pred_9 ?v3)
   (not (pred_7 ?v3 ?v11)) (not (pred_1 ))))


(:action op_5
:parameters (?v11 ?v12 ?v13)
:precondition (and (pred_12 ?v11) (pred_8 ?v12) (pred_8 ?v13)
                  (pred_6 ?v11) (pred_9 ?v13) (pred_7 ?v12 ?v11))
:effect (and (pred_9 ?v12) (pred_7 ?v13 ?v11)
        (not (pred_9 ?v13)) (not (pred_7 ?v12 ?v11))))

(:action op_3
:parameters (?v11 ?v3)
:precondition (and (pred_12 ?v11) (pred_8 ?v3) 
                  (pred_6 ?v11) (pred_9 ?v3))
:effect (and (pred_1 ) (pred_7 ?v3 ?v11) (not (pred_9 ?v3)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_14 obj_05 obj_13 obj_12 obj_20 obj_16 obj_04 obj_02 obj_15 obj_10 obj_11 obj_06 obj_09 obj_01 obj_19 obj_07
    obj_18 obj_03
    obj_08 obj_17
    )

    (:init
       (pred_1)

       (pred_12 obj_14)
       (pred_12 obj_05)
       (pred_12 obj_13)
       (pred_12 obj_12)
       (pred_12 obj_20)
       (pred_12 obj_16)
       (pred_12 obj_04)
       (pred_12 obj_02)
       (pred_12 obj_15)
       (pred_12 obj_10)
       (pred_12 obj_11)
       (pred_12 obj_06)
       (pred_12 obj_09)
       (pred_12 obj_01)
       (pred_12 obj_19)
       (pred_12 obj_07)
       (pred_3 obj_18)
       (pred_3 obj_03)
       (pred_8 obj_08)
       (pred_8 obj_17)

       (pred_5 obj_14 obj_20)
       (pred_5 obj_14 obj_05)
       (pred_5 obj_05 obj_16)
       (pred_5 obj_05 obj_13)
       (pred_5 obj_05 obj_14)
       (pred_5 obj_13 obj_04)
       (pred_5 obj_13 obj_12)
       (pred_5 obj_13 obj_05)
       (pred_5 obj_12 obj_02)
       (pred_5 obj_12 obj_13)
       (pred_5 obj_20 obj_15)
       (pred_5 obj_20 obj_16)
       (pred_5 obj_20 obj_14)
       (pred_5 obj_16 obj_10)
       (pred_5 obj_16 obj_04)
       (pred_5 obj_16 obj_05)
       (pred_5 obj_16 obj_20)
       (pred_5 obj_04 obj_11)
       (pred_5 obj_04 obj_02)
       (pred_5 obj_04 obj_13)
       (pred_5 obj_04 obj_16)
       (pred_5 obj_02 obj_06)
       (pred_5 obj_02 obj_12)
       (pred_5 obj_02 obj_04)
       (pred_5 obj_15 obj_09)
       (pred_5 obj_15 obj_10)
       (pred_5 obj_15 obj_20)
       (pred_5 obj_10 obj_01)
       (pred_5 obj_10 obj_11)
       (pred_5 obj_10 obj_16)
       (pred_5 obj_10 obj_15)
       (pred_5 obj_11 obj_19)
       (pred_5 obj_11 obj_06)
       (pred_5 obj_11 obj_04)
       (pred_5 obj_11 obj_10)
       (pred_5 obj_06 obj_07)
       (pred_5 obj_06 obj_02)
       (pred_5 obj_06 obj_11)
       (pred_5 obj_09 obj_01)
       (pred_5 obj_09 obj_15)
       (pred_5 obj_01 obj_19)
       (pred_5 obj_01 obj_10)
       (pred_5 obj_01 obj_09)
       (pred_5 obj_19 obj_07)
       (pred_5 obj_19 obj_11)
       (pred_5 obj_19 obj_01)
       (pred_5 obj_07 obj_06)
       (pred_5 obj_07 obj_19)
       (pred_10 obj_06)
       (pred_10 obj_10)
       (pred_2  obj_06 obj_18)
       (pred_2  obj_10 obj_03)
       (pred_4 obj_14)
       (pred_4 obj_05)
       (pred_4 obj_13)
       (pred_4 obj_12)
       (pred_4 obj_20)
       (pred_4 obj_16)
       (pred_4 obj_04)
       (pred_4 obj_02)
       (pred_4 obj_15)
       (pred_4 obj_11)
       (pred_4 obj_09)
       (pred_4 obj_01)
       (pred_4 obj_19)
       (pred_4 obj_07)

       (pred_11  obj_08 obj_18)
       (pred_11  obj_17 obj_03)
       (pred_7 obj_08 obj_12)
       (pred_7 obj_17 obj_05)
       (pred_6 obj_16)
    )

    (:goal (and
       (pred_7 obj_17 obj_11)
    ))
(:constraints
  (always (not (pred_6 obj_04)))
)
)

; plan
1. (op_1 obj_16 obj_05)
   deleted: (pred_6 obj_16)
   added: (pred_6 obj_05)
   goals met: 0 of 1
2. (op_4 obj_05 obj_17)
   deleted: (pred_7 obj_17 obj_05) (pred_1)
   added: (pred_9 obj_17)
   goals met: 0 of 1
3. (op_1 obj_05 obj_16)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_16)
   goals met: 0 of 1
4. (op_2 obj_16 obj_10 obj_17 obj_03)
   deleted: (pred_10 obj_10)
   added: (pred_4 obj_10)
   goals met: 0 of 1
5. (op_1 obj_16 obj_10)
   deleted: (pred_6 obj_16)
   added: (pred_6 obj_10)
   goals met: 0 of 1
6. (op_1 obj_10 obj_11)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_11)
   goals met: 0 of 1
7. (op_3 obj_11 obj_17)
   deleted: (pred_9 obj_17)
   added: (pred_1) (pred_7 obj_17 obj_11)
   goals met: 1 of 1
